// ================================================================================
// File         : PhaseType.cs
// Author       : Iwai Shogo
//
// Description  : バトルの各局面(準備フェーズ、実行フェーズ)を定義します。
// Created      : 2026-04-18
// ================================================================================

namespace CreatorKousien.Battle
{
    /// <summary>
    /// バトルの各局面(準備フェーズ、実行フェーズ)を定義します。
    /// </summary>
    public enum PhaseType
    {
        Init,       // バトル開始 (イントロ等)
        Command,    // 準備 (時間ゲージ減少、カード選択、敵の思考)
        Action,     // 実行 (6手のアクションを順次解決)
        TurnEnd     // ターン終了 (床効果、次ターンの準備)
    }
}
